import org.junit.After;
import org.junit.Before;
import org.junit.Test;

import java.io.ByteArrayInputStream;
import java.io.ByteArrayOutputStream;
import java.io.PrintStream;

import static org.junit.Assert.assertEquals;


public class AppTest {

    private final ByteArrayOutputStream outContent = new ByteArrayOutputStream();
    private final PrintStream originalOut = System.out;

    @Before
    public void setUpStreams() {
        System.setOut(new PrintStream(outContent));
    }

    @After
    public void restoreStreams() {
        System.setOut(originalOut);
    }

    @Test
    public void winXTest(){
        System.setIn(new ByteArrayInputStream("1 4 2 5 3".getBytes()));
        App.main(new String[]{});
        assertEquals(winXOutput, outContent.toString());
    }

    @Test
    public void drawTest(){
        System.setIn(new ByteArrayInputStream("5 1 8 2 3 7 4 6 9".getBytes()));
        App.main(new String[]{});
        assertEquals(drawOutput, outContent.toString());
    }

    @Test
    public void winOTest(){
        System.setIn(new ByteArrayInputStream("1 4 2 5 7 6".getBytes()));
        App.main(new String[]{});
        assertEquals(winOOutput, outContent.toString());
    }

    private final String winXOutput =
            "КРЕСТИКИ-НОЛИКИ\n" +
                    "|---|---|---|\n" +
                    "| 1 | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "'X' ходит первым. Введи номер ячейки, в которое поместишь 'X':\n" +
                    "|---|---|---|\n" +
                    "| X | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| O | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | 3 |\n" +
                    "|-----------|\n" +
                    "| O | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | 3 |\n" +
                    "|-----------|\n" +
                    "| O | O | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | X |\n" +
                    "|-----------|\n" +
                    "| O | O | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "Поздравляем! X победил!\n";

    private final String drawOutput =
            "КРЕСТИКИ-НОЛИКИ\n" +
                    "|---|---|---|\n" +
                    "| 1 | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "'X' ходит первым. Введи номер ячейки, в которое поместишь 'X':\n" +
                    "|---|---|---|\n" +
                    "| 1 | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | X | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | X | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | X | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | X | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | O | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | X | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | X | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | O | X |\n" +
                    "|-----------|\n" +
                    "| 4 | X | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | X | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | O | X |\n" +
                    "|-----------|\n" +
                    "| 4 | X | 6 |\n" +
                    "|-----------|\n" +
                    "| O | X | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | O | X |\n" +
                    "|-----------|\n" +
                    "| X | X | 6 |\n" +
                    "|-----------|\n" +
                    "| O | X | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | O | X |\n" +
                    "|-----------|\n" +
                    "| X | X | O |\n" +
                    "|-----------|\n" +
                    "| O | X | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| O | O | X |\n" +
                    "|-----------|\n" +
                    "| X | X | O |\n" +
                    "|-----------|\n" +
                    "| O | X | X |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "Ничья!\n";

    private final String winOOutput =
            "КРЕСТИКИ-НОЛИКИ\n" +
                    "|---|---|---|\n" +
                    "| 1 | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "'X' ходит первым. Введи номер ячейки, в которое поместишь 'X':\n" +
                    "|---|---|---|\n" +
                    "| X | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| 4 | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | 2 | 3 |\n" +
                    "|-----------|\n" +
                    "| O | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | 3 |\n" +
                    "|-----------|\n" +
                    "| O | 5 | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | 3 |\n" +
                    "|-----------|\n" +
                    "| O | O | 6 |\n" +
                    "|-----------|\n" +
                    "| 7 | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "X ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | 3 |\n" +
                    "|-----------|\n" +
                    "| O | O | 6 |\n" +
                    "|-----------|\n" +
                    "| X | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "O ходит, введите номер ячейки:\n" +
                    "|---|---|---|\n" +
                    "| X | X | 3 |\n" +
                    "|-----------|\n" +
                    "| O | O | O |\n" +
                    "|-----------|\n" +
                    "| X | 8 | 9 |\n" +
                    "|-----------|\n" +
                    "\n" +
                    "Поздравляем! O победил!\n";
}
